Revit 2027 API
BindingMap.Insert(Definition, Binding, ForgeTypeId) Method
 Creates a new parameter binding between a parameter and a set of categories in a specified group.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Insert(
	Definition key,
	Binding item,
	ForgeTypeId groupTypeId
)
Public Overridable Function Insert (
	key As Definition,
	item As Binding,
	groupTypeId As ForgeTypeId
) As Boolean
public:
virtual bool Insert(
	Definition^ key,
	Binding^ item,
	ForgeTypeId^ groupTypeId
)
abstract Insert :
        key : Definition *
        item : Binding *
        groupTypeId : ForgeTypeId -> bool
override Insert :
        key : Definition *
        item : Binding *
        groupTypeId : ForgeTypeId -> bool
Parameters
key Definition
 A parameter definition which can be an existing definition or one from a shared parameters file.
item Binding
 An InstanceBinding or TypeBinding object which contains the set of categories to which the parameter should be bound.
groupTypeId ForgeTypeId
 The identifier of the parameter definition's parameter group, or empty if the parameter is not to be associated with any predefined group.
Return Value
Boolean
Remarks
 Note the type of the binding object dictates whether the parameter is bound to all instances or just types. A parameter definition cannot be bound to both instances and types. If the Parameter binding already exists, post an error and return false
See Also
Reference
BindingMap Class
Insert Overload
Autodesk.Revit.DB Namespace